In [112]:
import pandas as pd

In [157]:
college = pd.ExcelFile("../../data/college.xlsx")
departments = college.parse(0)
teachers = college.parse(1)
students = college.parse(2)
courses = college.parse(3)
classrooms = college.parse(4)

In [158]:
courses.head()

   CourseID            CourseName  DepartmentID  TeacherID
0         1     English Begginers             1         15
1         2      Advanced English             1         15
2         3  Proffesional English             1         15
3         4       Mathematics 101             2          2
4         5   Matematics Advanced             2         13

In [159]:
classrooms.head()

   CourseID  StudentID     degree
0         1        202  92.031070
1         1         12  81.175916
2         1        232  82.396587
3         1        123  62.420449
4         1        274  72.569900

In [160]:
result = pd.merge(courses, departments, on='DepartmentID', how='inner')

In [161]:
result.head()

   CourseID            CourseName  DepartmentID  TeacherID DepartmentName
0         1     English Begginers             1         15        English
1         2      Advanced English             1         15        English
2         3  Proffesional English             1         15        English
3         4       Mathematics 101             2          2        Science
4         5   Matematics Advanced             2         13        Science

In [162]:
class_cour = pd.merge(classrooms, courses, on='CourseID', how='left')
dep_class_cour = pd.merge(departments, class_cour, on='DepartmentID', how='left')

In [163]:
dep_class_cour.head()

,DepartmentID,DepartmentName,CourseID,StudentID,degree,CourseName,TeacherID
0,1,English,1,202,92.031070,English Begginers,15
1,1,English,1,12,81.175916,English Begginers,15
2,1,English,1,232,82.396587,English Begginers,15
3,1,English,1,123,62.420449,English Begginers,15
4,1,English,1,274,72.569900,English Begginers,15

In [164]:
len(dep_class_cour)

754

In [165]:
len(dep_class_cour.loc[(dep_class_cour['DepartmentName']=='English')])

94

In [168]:
result = dep_class_cour.groupby('DepartmentName').agg({'StudentID':'count'})
print(result)

                StudentID
DepartmentName
Arts                  186
English                94
Science               378
Sport                  96

In [167]:

English_num = len(dep_class_cour.loc[(dep_class_cour['DepartmentName']=='English')])
Science = len(dep_class_cour.loc[(dep_class_cour['DepartmentName']=='Science')])